'''Ввести последовательно возраст Антона, Бориса и Виктора. Определить, кто из них старше.
Пример:
Возраст Антона: 15
Возраст Бориса: 17
Возраст Виктора: 16
Ответ: Борис старше всех.
Пример:
Возраст Антона: 17
Возраст Бориса: 17
Возраст Виктора: 16
Ответ: Антон и Борис старше Виктора.'''

a = 'Антон'
b = 'Борис'
c = 'Виктор'

aA = int(input(f'Введите возраст {a}a: '))
bB = int(input(f'Введите возраст {b}a: '))
cC = int(input(f'Введите возраст {c}a: '))
d = max(aA, bB, cC)

if aA == bB and aA == cC:
    print(f'{a}, {b} и {c} одного возраста')
elif d == aA and d == bB:
    print(f'{a} и {b} старше {c}a')
elif d == bB and d == cC:
    print(f'{b} и {c} старше {a}a')
elif d == aA and d == cC:
    print(f'{a} и {c} старше {b}a')
elif d == aA:
    print(f'{a} старше {b}a и {c}а')
elif d == bB:
    print(f'{b} старше {a}a и {c}а')
elif d == cC:
    print(f'{c} старше {a}a и {b}а')